#### Pandas 심화 내용 (조건, 그룹, Multiindex)

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.random.rand(10, 2), columns=['X', 'Y'])
df

          X         Y
0  0.536780  0.125256
1  0.391118  0.315744
2  0.624799  0.087524
3  0.373231  0.010558
4  0.912807  0.933407
5  0.608555  0.446304
6  0.080984  0.430996
7  0.847141  0.871137
8  0.345127  0.616159
9  0.708725  0.663250

In [3]:
df['X'] > 0.5

0     True
1    False
2     True
3    False
4     True
5     True
6    False
7     True
8    False
9     True
Name: X, dtype: bool

In [4]:
df[(df['X'] > 0.5) & (df['Y'] < 0.5)]

          X         Y
0  0.536780  0.125256
2  0.624799  0.087524
5  0.608555  0.446304

In [5]:
df.query("X > 0.5 and Y < 0.5")

          X         Y
0  0.536780  0.125256
2  0.624799  0.087524
5  0.608555  0.446304

In [6]:
# 문자열

In [7]:
li = ["Kim", "Lee", "Park"]
li2 = ["Book", "Cook", "Game"]
df = pd.DataFrame({'Name': li, 'Good': li2})
df

   Name  Good
0   Kim  Book
1   Lee  Cook
2  Park  Game

In [8]:
df[df['Good'].str.contains("oo")]

  Name  Good
0  Kim  Book
1  Lee  Cook

In [9]:
df[df.Good.str.match('oo')]

Empty DataFrame
Columns: [Name, Good]
Index: []

In [10]:
# ======================================================================================================================

In [11]:
# apply를 사용하여 함수로 데이터 변경
df = pd.DataFrame(np.arange(5) + 10, columns=['Num'])
print(df)
def squ(x):
  return x**2

   Num
0   10
1   11
2   12
3   13
4   14

In [12]:
df['Num'].apply(squ)

0    100
1    121
2    144
3    169
4    196
Name: Num, dtype: int64

In [13]:
df['Square'] = df.Num.apply(lambda x: x ** 2)
df

   Num  Square
0   10     100
1   11     121
2   12     144
3   13     169
4   14     196

In [14]:
# ======================================================================================================================

In [15]:
# groupby 그룹으로 묶기 : 조건부로 집계하고 싶은 경우 사용

In [25]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'], 'data1': [3, 2, 1, 1, 2, 3], 'data2': np.random.randint(0, 6, 6)})
df

  key  data1  data2
0   A      3      4
1   B      2      2
2   C      1      5
3   A      1      4
4   B      2      4
5   C      3      4

In [26]:
df.groupby('key').sum()

     data1  data2
key
A        4      8
B        4      6
C        4      9

In [27]:
df.groupby(['key', 'data1']).sum()

           data2
key data1
A   1          4
    3          4
B   2          6
C   1          5
    3          4

In [16]:
# aggregate : groupby를 통하여 집계를 한번에 계산

In [29]:
df.groupby('key').aggregate(['min', np.median, 'max'])

    data1            data2
      min median max   min median max
key
A       1      2   3     4    4.0   4
B       2      2   2     2    3.0   4
C       1      2   3     4    4.5   5

In [30]:
def filter_by_mean(x):
  return x['data2'].mean() > 3

print(df.groupby('key').mean())
print(df.groupby('key').filter(filter_by_mean))

     data1  data2
key
A      2.0    4.0
B      2.0    3.0
C      2.0    4.5
  key  data1  data2
0   A      3      4
2   C      1      5
3   A      1      4
5   C      3      4

In [32]:
df.groupby('key').apply(lambda x: x.max() - x.min())

     data1  data2
key
A        2      0
B        0      2
C        2      1

In [30]:
# ======================================================================================================================

In [ ]:
# MultiIndex

In [34]:
df = pd.DataFrame(
    np.random.randn(4, 4),
    columns=[['A', 'A', 'B', 'B'], ['2', '1', '2', '1']]
)
df

          A                   B
          2         1         2         1
0 -0.302945 -1.048453 -1.143981  0.935873
1 -0.281833 -0.442383 -0.228714 -0.365827
2 -0.230919 -0.829994 -0.709416  0.927025
3 -1.595969  1.196024  0.344558 -0.090058

In [36]:
df['A']['1']

0   -1.048453
1   -0.442383
2   -0.829994
3    1.196024
Name: 1, dtype: float64

In [ ]:
# pivot table : 데이터에서 필요한 자료만 뽑아서 새롭게 요약, 엑셀에서 피봇 테이블과 같다
# index = key, column 열 인덱스로 라벨링될 값, value 분석할 데이터

In [41]:
# df.pivot_table(
#     index='sex', columns='class', values='survived'
# )